webservice/src/main/java/com/walterwhites/library/webservice/test/all_book.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="library.io.github.walterwhites">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getAllBookRequest/>
    </soapenv:Body>
</soapenv:Envelope>